{
"About": {
  "Name": "Tien Le",
  "Currently": "Computer Science Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Tien Le. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to computer science, including hackathons, coding competitions, and open-source contributions. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "EMail": "len8@spu.edu",
  "Phone": "",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://www.linkedin.com/in/tien-le-368658248/",
  "GitHub": "https://github.com/tienle02"
},
"Experience": {
  "ExperienceText": "I am an international transfer student, and this is my first year at Seattle Pacific University (SPU). I started my college journey at Broward College in Vietnam, studying Software Development <br><br> I'm excited to be here and look forward to making the most of my time at SPU.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2026",
  "EducationText": "",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Lab Assistant",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", " JavaScript", " Node", " CSS"," HTML"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "Focus Critters App Project - System Proposal and System Specification",
    "Desc": "Focus Critters is a mobile application designed to enhance focus, productivity, and engagement during study sessions through gamification and social interaction. This app integrates a virtual pet that grows and evolves as users complete focused study sessions, fostering a fun and motivating study environment. Users can also collaborate with friends, share music playlists, and track their progress with personalized analytics..<br><br>This project is available on Github",
    "GitHubRepo": "https://github.com/tienle02/system-design-project.git",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  }
}
